docs/docs_fase3-vistas-arquitectonicas.md
```mermaid
%%{init: {'theme':'base', 'themeVariables': {
  'primaryColor': '#E1F5EE',
  'primaryTextColor': '#04342C',
  'primaryBorderColor': '#0F6E56',
  'lineColor': '#5F5E5A',
  'actorBkg': '#EEEDFE',
  'actorBorder': '#534AB7',
  'actorTextColor': '#26215C',
  'signalColor': '#2C2C2A',
  'signalTextColor': '#2C2C2A',
  'noteBkgColor': '#FAECE7',
  'noteBorderColor': '#993C1D',
  'noteTextColor': '#4A1B0C'
}}}%%
sequenceDiagram
    autonumber
    actor Sensor as Sensor IoT
    participant Ingestion as Ingesta IoT
    participant Trafico as Gestión Tráfico
    participant Semaforo as Gestión Semáforos
    participant Alertas as Gestión Alertas
    actor App as App Móvil

    Sensor->>Ingestion: Telemetría Tráfico Alto
    Ingestion->>Trafico: Evento TelemetriaRecibida
    Trafico->>Trafico: Evaluar Umbral Congestión
    Trafico->>Semaforo: Notificar Congestión Detectada
    Semaforo->>Semaforo: Calcular Nueva Fase Verde
    Semaforo->>Sensor: Comando AmpliarFaseVerde()
    Trafico->>Alertas: Emitir Alerta Congestión
    Alertas->>App: Push Notification Geolocalizada
```
